x = int(input("Введите число: "))
y = int(input("Введите число: "))
print(f"Введенные {x}, {y} входят: {(x <= -1) and (y <= -2)}")
print(f"Введенные {x}, {y} входят: {(y >= 1) and (y <= -3)}")
print(f"Введенные {x}, {y} входят: {(y <= -3) and (y >= -4) and (y <= 1)}")

x = int(input("Координата x: "))
y = int(input("Координата y: "))
print(f"Координаты {x}, {y} подходят: {(y >= 2) and (y <= 4) and {x >= 1}}")
print(f"Координаты {x}, {y} подходят: {
    (y >= 2) and (x >= 0) or ((y <= -1) and (x <= -1))}")
print(f"Координаты {x}, {y} подходят: {
    (y >= 1) and (x >= 2) or ((y <= -1.5) and (x <= -2))}")

x = int(input("Введите число: "))
y = int(input("Введите число: "))

print(f"Введенные {x}, {y} подходят: {1 <= x <= 3 and 1 >= y >= 3}")
print(f"Введенные {x}, {y} подходят: \
{(1 <= x <= 2.5 and 1.5 >= y >= -2) or y >= 1.5}")
